7767517
63 70
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=24 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=648 9=1
ConvolutionDepthWise     convdwrelu_0             1 1 1 2 0=24 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=216 7=24 9=1
Convolution              convrelu_1               1 1 2 3 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
ConvolutionDepthWise     convdwrelu_1             1 1 3 4 0=24 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=216 7=24 9=1
Convolution              convrelu_2               1 1 4 5 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152 9=1
ConvolutionDepthWise     convdwrelu_2             1 1 5 6 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48 9=1
Convolution              convrelu_3               1 1 6 7 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
ConvolutionDepthWise     convdwrelu_3             1 1 7 8 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48 9=1
Convolution              convrelu_4               1 1 8 9 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
ConvolutionDepthWise     convdwrelu_4             1 1 9 10 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48 9=1
Convolution              convrelu_5               1 1 10 11 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Split                    splitncnn_0              1 2 11 12 13
ConvolutionDepthWise     convdwrelu_5             1 1 13 14 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432 7=48 9=1
Convolution              convrelu_6               1 1 14 15 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608 9=1
ConvolutionDepthWise     convdwrelu_6             1 1 15 16 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96 9=1
Convolution              convrelu_7               1 1 16 17 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
ConvolutionDepthWise     convdwrelu_7             1 1 17 18 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96 9=1
Convolution              convrelu_8               1 1 18 19 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
ConvolutionDepthWise     convdwrelu_8             1 1 19 20 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96 9=1
Convolution              convrelu_9               1 1 20 21 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
ConvolutionDepthWise     convdwrelu_9             1 1 21 22 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96 9=1
Convolution              convrelu_10              1 1 22 23 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
ConvolutionDepthWise     convdwrelu_10            1 1 23 24 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96 9=1
Convolution              convrelu_11              1 1 24 25 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
ConvolutionDepthWise     convdwrelu_11            1 1 25 26 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96 9=1
Convolution              convrelu_12              1 1 26 27 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
ConvolutionDepthWise     convdwrelu_12            1 1 27 28 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96 9=1
Convolution              convrelu_13              1 1 28 29 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
Split                    splitncnn_1              1 2 29 30 31
ConvolutionDepthWise     convdwrelu_13            1 1 31 32 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864 7=96 9=1
Convolution              convrelu_14              1 1 32 33 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432 9=1
ConvolutionDepthWise     convdwrelu_14            1 1 33 34 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192 9=1
Convolution              convrelu_15              1 1 34 35 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864 9=1
ConvolutionDepthWise     convdwrelu_15            1 1 35 36 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192 9=1
Convolution              convrelu_16              1 1 36 37 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864 9=1
ConvolutionDepthWise     convdwrelu_16            1 1 37 38 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192 9=1
Convolution              convrelu_17              1 1 38 39 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864 9=1
Pooling                  avgpool2d_0              1 1 12 40 0=1 1=3 11=3 12=2 13=1 2=2 3=1 5=1 6=1
Interp                   upsample_73              1 1 39 41 0=1 1=2.0 2=2.0 6=0
Concat                   cat_0                    3 1 40 30 41 42 0=0
Convolution              conv_19                  1 1 42 43 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32256
Split                    splitncnn_2              1 4 43 44 45 46 47
ConvolutionDepthWise     convdwrelu_17            1 1 47 48 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96 9=1
ConvolutionDepthWise     convdwrelu_18            1 1 46 49 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96 9=1
ConvolutionDepthWise     convdwrelu_19            1 1 49 50 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96 9=1
ConvolutionDepthWise     convdwrelu_20            1 1 45 51 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96 9=1
ConvolutionDepthWise     convdwrelu_21            1 1 51 52 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96 9=1
ConvolutionDepthWise     convdwrelu_22            1 1 52 53 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96 9=1
Concat                   cat_1                    3 1 48 50 53 54 0=0
Convolution              conv_20                  1 1 54 55 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=27648
BinaryOp                 add_0                    2 1 44 55 56 0=0
ReLU                     relu_66                  1 1 56 57
Convolution              convrelu_18              1 1 57 58 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216 9=1
Split                    splitncnn_3              1 3 58 59 60 61
ConvolutionDepthWise     convdwrelu_23            1 1 61 62 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96 9=1
Convolution              convsigmoid_19           1 1 62 63 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=96 9=4
ConvolutionDepthWise     convdwrelu_24            1 1 60 64 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96 9=1
Convolution              conv_23                  1 1 64 65 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=384
ConvolutionDepthWise     convdwrelu_25            1 1 59 66 0=96 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=2400 7=96 9=1
Convolution              conv_24                  1 1 66 67 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7680
Softmax                  softmax_72               1 1 67 68 0=0 1=1
Concat                   cat_2                    3 1 63 65 68 out0 0=0
